{
  "name": "Terrastone Tools",
  "icon": "roots:terrastone_hoe",
  "category": "apparatus",
  "pages": [
    {
      "type": "text",
      "text": "Stone is not unliving. Imbuing raw stone with the brilliance of lapis results in $(l:resources/runestone)runestone$(). In the same fashion can shaped stone tools be imbued with the strength of diamonds and moss to create powerful tools that become almost fluid, flowing back to reform any damage that it might take.$(br2)$(info) It has the effectiveness of a diamond tool, and can be manually repaired with mossy stone."
    },
    {
      "type": "fey_crafting_template",
      "recipe": "terrastone_pickaxe"
    },
    {
      "type": "text",
      "text": "This pick-axe is not only incredibly sharp, it has increased efficiency against both extremely strong and extremely weak and mundane materials.$(br2)$(info) Has greater efficiency against cobblestone and materials of similar softness, and greater efficiency against obsidian and harder blocks."
    },
    {
      "type": "fey_crafting_template",
      "recipe": "terrastone_axe"
    },
    {
      "type": "text",
      "text": "This axe is capable of instantly destroying any leaves that it comes into contact with."
    },
    {
      "type": "fey_crafting_template",
      "recipe": "terrastone_shovel"
    },
    {
      "type": "text",
      "text": "The earth has blessed this shovel, to the point where it is capable of carefully removing grass, mycelium and podzol without turning them into dirt."
    },
    {
      "type": "fey_crafting_template",
      "recipe": "terrastone_hoe"
    },
    {
      "type": "text",
      "text": "Ground tilled with this hoe will instantly become moisturized. In addition, leaves and vines broken with it will break as though harvested with shears."
    },
    {
      "type": "fey_crafting_template",
      "recipe": "terrastone_sword"
    },
    {
      "type": "text",
      "text": "This flame-blessed, sharpened sword is capable of instantly destroying cobwebs as though they were broken with shears."
    },
    {
      "type": "relations",
      "entries": [
        "basics/other_imbuer",
        "apparatus/living_tools"
      ]
    }
  ]
}