{
  "name": "Introduction to Rituals",
  "icon": "minecraft:writable_book",
  "category": "rituals",
  "sortnum": 1,
  "priority": true,
  "pages": [
    {
      "type": "text",
      "text": "Rituals are a way of unlocking the wild energy of nature at harnessing it for a specific purpose.$(br2)The primary device used in rituals is a $(l:crafting/devices/pyres)Pyre$(), and it is upon this pyre that the five necessary ingredients to perform the ritual are placed by right-clicking.$(br2)Lighting the pyre is the final step to begin the ritual."
    },
    {
      "type": "text",
      "text": "Once the correct ingredients are placed on the pyre, the HUD will information about the ritual.$(br2)$(info) It can then be started with a $(l:rituals/fire_starter)flint-and-steel, fire starter$().$(br2)Some rituals require additional components to function that are placed near the pyre.$(br2)$(info) Some require $(l:rituals/standing_stones)standing stones or runed pillars$(). Additionally, a ritual might require $(l:rituals/catalyst_plates)a catalyst plate$() to direct the wild energy."
    },
    {
      "type": "text",
      "text": "There are a small number of rituals that require components in addition to those mentioned, but those will be specified in the entry for the ritual itself.$(br2)$(info) In the event that you wish to end a ritual early, you can throw a bucket of water on it."
    },
    {
      "type": "text",
      "title": "Ritual Tiers",
      "text": "($(o)See $(l:rituals/tiers)Ritual Tiers$())$(br2)Some rituals will require additional components. The ritual's entry will display this as a multiblock image and note what components are required.$(br2)Because of this, rituals can be classed as tiers, with the tier number being equivalent to the number of components required.$(br2)Thus, it is possible to list $(l:rituals/tiers)rituals by tier$()."
    },
    {
      "type": "text",
      "title": "Ritual Specifics",
      "text": "All ritual entries will list specific details. The type of details will very depending on the type of ritual, but it will generally list the size of the ritual, the duration of the ritual, etc.$(br2)More complex rituals will also list details about how their individual functions operate and how frequently they operate."
    },
    {
      "type": "text",
      "title": "Visualisation",
      "text": "($(o)See $(l:rituals/visualisation)Ritual Visualisation$())$(br2)If a ritual has a specific radius or cube size, it's possible to have the exact range of the ritual displayed in-world.$(br2)To do so, sneak-right-click a $(l:crafting/devices/pyres)pyre$() that has ritual ingredients in it (or displays a previously activated ritual) with a $(l:crafting/armor_and_tools/knives)knife$()."
    },
    {
      "type": "text",
      "title": "Automation",
      "text": "($(o)See $(l:rituals/automation)Ritual Automation$())$(br2)Ingredients for rituals can be stored in a chest beneath the pyre, and they will be consumed from there automatically whenever the pyre is empty.$(br2)An already-started ritual will automatically continue if new ingredients are provided, but nearby sources of flame will also be consumed to start a ritual."
    }
  ]
}