{
  "name": "Элементальная почва",
  "icon": "roots:elemental_soil",
  "category": "resources",
  "priority": true,
  "advancement": "roots:fey_crafter",
  "pages": [
    {
      "type": "spotlight",
      "item": "roots:elemental_soil",
      "link_recipe": true,
      "text": "Некоторые травы достаточно привередлевы до почвы. Сама по себе Элементальная почва ускоряет роста любого растения. А еще она может быть пропитана элементом, который позволит особо требовательным травам спокойно произрастать."
    },
    {
      "type": "fey_crafting_template",
      "recipe": "elemental_soil"
    },
    {
      "type": "spotlight",
      "item": "roots:elemental_soil_fire",
      "link_recipe": true,
      "text": "$(l:herbs/infernal_bulb)Инфернол$() растет на Огненной почве. Ее можно получить выкинув Элементальную почву в лаву.$(br2)При сборе, выращенные на Огненной почве растения, будут автоматически приготовлены. Кроме того, с каждого из них может упасть опыт."
    },
    {
      "type": "spotlight",
      "item": "roots:elemental_soil_water",
      "link_recipe": true,
      "text": "$(l:herbs/dewgonia)Девгония$() растет на Водной почве. Ее можно получить выкинув Элементальную почву в воду.$(br2)Выращенные на Водной почве растения будут автоматически собраны. Плоды попадут в контейнеры под почвой или останутся на поверхности.$(br)$(info)Поместив гравий под почву вы отключите ее свойства."
    },
    {
      "type": "spotlight",
      "item": "roots:elemental_soil_air",
      "link_recipe": true,
      "text": "$(l:herbs/cloud_berry)Облачник$() растет на Небесной почве. Ее можно получить просто выкинув Элементальную почву (на высоте 90 блоков и выше).$(br2)Так-же рост растений значительно ускорится при использовании этой почвы."
    },
    {
      "type": "spotlight",
      "item": "roots:elemental_soil_earth",
      "link_recipe": true,
      "text": "$(l:herbs/stalicripe)Затхлый корень$() растет на Земной почве. Ее можно получить просто выкинув Элементальную почву (на высоте 30 блоков и ниже).$(br2)Выращенные на Земной почве растения дадут гораздо больше урожая."
    },
    {
      "type": "relations",
      "entries": [
        "herbs/cloud_berry",
        "herbs/infernal_bulb",
        "herbs/dewgonia",
        "herbs/stalicripe"
      ]
    }
  ]
}