{
    "name": "Письмо от Друида",
    "icon": "minecraft:paper",
    "category": "basics",
    "advancement": "roots:root",
    "priority": true,
    "sortnum": 2,
    "pages": [
      {
        "type": "text",
        "title": "Дорогой друид,",
        "text": "Зачастую нам бывает трудно в этом мире. Процесс жизни в гармонии с природой может показаться приятным идеалом, когда все идет хорошо, но если солнце садится и темнота правит землей, уважение к природе может стать трудной задачей."
      },
      {
        "type": "crafting",
        "recipe": "roots:assorted_seeds",
        "text": "Искушение может посетить вас, когда вы голодаете, но даже в худшие времена вы можете найти утешение в горсти семян."
      },
      {
        "type": "text",
        "title": "Дикий корень",
        "text": "Я многое изучил о$(l:herbs/wildroot) диком корне$(), этот чудесный, наполненный магией корень, зачастую прорастает в высокой траве.$(br2)Когда-то это были корни огромных деревьев, известных как ВайлдВудс, давно исчезнувших с лица земли. Однако их корни все еще сохраняет жизненную силу."
      },
      {
        "type": "crafting",
        "recipe": "mysticalworld:stuffed_aubergine",
        "title": "Aubergine",
        "text": "$(l:resources/aubergine)Баклажан$() может быть вкусно приготовлен в сочетании с другими корнеплодами.$(br2)Его скрытая магия слаба, но вы найдете ей применение в заклинаниях и ритуалах."
      },
      {
        "type": "text",
        "title": "Мох",
        "text": "Странные $(l:herbs/terra_moss)споры$(), которые можно найти в высокой траве, лучше всего растут, если их разместить на булыжник у воды. Затем получившийся мох можно соскребсти ножом.$(br2)Однако не бойтесь, что вы проведете свои дни, ломая траву в поисках спор, ибо есть ритуал $(l:rituals/ritual_overgrowth)Разрастания$(), который волшебным образом вырастит этот мох на подходящем камне."
      },
      {
        "type": "text",
        "title": "Другие культуры",
        "text": "Не бойтесь жертвовать пространством для выращивания других культур, например пшеницы или моркови. Они дадут вам пропитание, и вы можете найти подобных вам в мире, готовых обменять свою валюту на ваши товары.$(br2)Ухоженный сад навсегда станет для вас благом, и вы, возможно найдете $(l:apparatus/runestone)средство$() от вечного топтания почвы монстрами и животными."
      },
      {
        "type": "text",
        "title": "Другие друиды",
        "text": "Вы можете найти единомышленников-друидов, более продвинутых в искусстве, которые могут обменять предметы и ресурсы.$(br2)Это может дать вам необходимый толчок, или наведет вас на новые идеи и концепции. Некоторые из друидов могут быть готовы обменять даже свои самые ценные вещи!"
      },
      {
        "type": "text",
        "title": "Редкие ресурсы",
        "text": "Мое исследование различных заклинаний и ритуалов показало, что некоторые из них требуют редких ресурсов из различных отдаленных биомов.$(br2)Учитвая мой возраст, я не гожусь для подобных путешествий, но слышал рассказы о $(l:rituals/ritual_transmutation)Ритуале$(), который использует рунные камни, чтобы превращать одни вещи в другие."
      },
      {
        "type": "text",
        "text": "Я уже упоминал о своих преклонных годах, течение времени начинает ощущаться как замкнутая петля, которая положит конец моему нынешнему циклу на земле.$(br2)Бывали времена, когда я не мог ждать, пока созреет урожай при недостатке удобрения, на которое, кажется, реагируют все травы.$(br2)В эти трудные времена я нашел заклинание $(l:spells/spell_growth_infusion)Инфузии Роста$() полезно, хотя и утомительно по своей природе."
      },
      {
        "type": "text",
        "text": "Другие текста говорят о больших заклинаниях и ритуалах, позволяющих выращивать целые поля и леса, но это за пределами моих скудных навыков. Возможно, вы преуспеете там, где я не смог.$(br2)$(br2)На последок: никогда не отчаивайтесь! Если вы окажетесь в растерянности, и мои слова не смогут помочь, убедитесь, что вы попробовали все варианты."
      },
      {
        "type": "text",
        "text": "Прощай, мой друг! Хотя я не доживу, чтобы увидеть это, я знаю, что даже в самые темные моменты вашей жизни будут источники света и понимания.$(br2)$(бк2)$(бк2)- $(о)Подпись слишком блеклая, чтобы прочесть.$()"
      },
      {
        "type": "empty"
      }
    ]
  }