{
    "name": "Необходимые Ресурсы",
    "icon": "roots:wildroot",
    "category": "basics",
    "advancement": "roots:root",
    "sortnum": 5,
    "pages": [
      {
        "type": "text",
        "text": "Друиды нуждаются в различных природных ресурсах, чтобы проводить свои магические ритуалы. Сюда входят магические травы, каждая из которых по-разному связана с природой. Открытие травы раскроет многие тайны, и предоставит доступ к новым инструментам, заклинаниям и ритуалам для начинающего друида."  
      },
      {
        "type": "text",
        "title": "Земные Ресуры",
        "text": "Другие ресурсы гораздо более приземленны, но все же имеют большое значение для раскрытия потенциала искусств друидов. Ресурсы, такие как $(l:resources/bark)кора$() и $(l:resources/aubergine)баклажаны$() позволяют друиду получить доступ к энергиям самой природы."
      },
      {
        "type": "spotlight",
        "item": "minecraft:farmland",
        "title": "Возобновляемые Ресурсы",
        "text": "Почти каждый ресурс, к которому имеет доступ друид, является возобновляемым. Дикий корень и многие виды травы, которые вы обнаружите, могут быть посажены и выращены, хотя некоторые требуют особой поддержки."
      },
      {
        "type": "spotlight",
        "title": " ",
        "item": "minecraft:mossy_cobblestone",
        "text": "Даже с ресурсами, получение которых может быть утомительным, проницательный друид может обнаружить ритуал, заклинание или другой процесс, который позволит создавать их."
      },
      {
        "type": "text",
        "title": "Когда в растерянности",
        "text": "Не беспокойтесь! Вы можете найти в этой книге $(l:basics/letter)письмо$(), в котором описываются способы преодоления препятствий, подобных тем, с которыми вы можете столкнуться."
      },
      {
        "type": "relations",
        "entries": [
          "basics/letter",
          "basics/introduction",
          "rituals/ritual_overgrowth",
          "rituals/ritual_germination",
          "spells/spell_harvest",
          "spells/spell_growth_infusion",
          "spells/spell_rampant_growth",
          "apparatus/elemental_soil"
        ]
      }
    ]
  }