{
  "name": "Колдовство и Наполнение",
  "icon": "roots:staff",
  "category": "basics",
  "advancement": "roots:root",
  "sortnum": 4,
    "pages": [
    {
      "type": "text",
      "text": "Основная сила, доступная друиду, - это колдовство. Каждое заклинание требует определенных компонентов, которые необходимо размолоть, используя $(l:apparatus/mortar)Ступку и пест$(). Затем полученная смесь для заклинаний может быть помещена в посох.$(br2)Произнесение заклинаний требует материальных компонентов в виде трав."
    },
    {
      "type": "text",
      "text": "После того, как смесь была создана, ею необходимо наполнить посох. Во время этого процесса можно добавить дополнительные реагенты, чтобы навсегда изменить заклинание.$(br2)Наполнение не удалит старое заклинание, а вместо этого поместит новое в первый пустой слот, если таковой имеется.$(br2)Поместите как посох, так и смесь в наполнитель, чтобы начать процесс."
    },
    {
      "type": "crafting",
      "recipe": "roots:imbuer",
      "title": "Наполнитель",
      "text": "Понадобится немного времени, прежде чем посох будет возвращен, а новое заклинание готово к использованию.$(br2)Смесь для заклинаний может быть $(l:basics/spells#augmentation)усилена$() другими реагентами, перед наполнением в посох."
    },
    {
      "type": "crafting",
      "recipe": "roots:staff",
      "title": "Посох",
      "text": "Посох может быть сделан из любого дерева, ибо Дикий корень позволяет заклинаниям свободно активироваться. Кроме того, травы должны находится в подходящем $(l:apparatus/component_pouch)контейнере$()."
    },
    {
      "type": "text",
      "title": "Усиление",
      "anchor": "augmentation",
      "text": "Можно усилить некоторые заклинания, поместив их смесь в наполнитель без посоха, а затем применить один из реагентов, указанных в книге, для этого заклинания.$(br2)После этого, смесь можно поместить в посох.$(br2)$(info)Не все заклинания принимают модификаторы."
    },
    {
      "type": "text",
      "title": "Действия с Посохом",
      "text": "Посох способен удерживать до 5 заклинаний. Выбранное заклинание всегда отображается в Тул-типе, а удержание shift позволит показать все помещенные заклинания.$(br2)Присев при нажатии ПКМ вы можете пролистать все доступные заклинания.$(br2)Дополнительная привязка клавиш тоже присутствует."
    },
    {
      "type": "text",
      "title": "Произнесение Заклинаний",
      "text": "Посох можно держать в любой руке.$(br2)Если заклинание мгновенное, просто нажмите ПКМ, в противном случае удерживайте ПКМ для активации.$(br2)Eсли нужные компоненты доступны, они будут использованы, заклинание произнесено, и визуальное оповещение покажет вам оставшийся запас трав."
    },
    {
      "type": "text",
      "title": "Снятие Заклинаний",
      "text": "Поскольку сила посоха ограничена и может поддерживать только 5 заклинаний, вам может потребоваться возможность удаления.$(br2)Просто выберите нужное заклинание, а затем наполните посох $(l:resources/runic_dust)Рунической Пылью$().$(br2)Возвращенный посох будет иметь свободный слот там, где когда-то было заклинание."
    },
    {
      "type": "relations",
      "entries": [
        "basics/other_kmbuer",
        "apparatus/mortar"
      ]
    }
  ]
}