{
  "name": "Elemental Soil",
  "icon": "roots:elemental_soil",
  "category": "resources",
  "priority": true,
  "advancement": "roots:fey_crafter",
  "pages": [
    {
      "type": "spotlight",
      "item": "roots:elemental_soil",
      "link_recipe": true,
      "text": "Elementally attuned herbs can be picky about where - as fickle as the elements themselves. Elemental soil itself increases the rate at which any plant grows, but it can also be imbued with an element to allow the corresponding plant to grow."
    },
    {
      "type": "fey_crafting_template",
      "recipe": "elemental_soil"
    },
    {
      "type": "spotlight",
      "item": "roots:elemental_soil_fire",
      "link_recipe": true,
      "text": "$(l:herbs/infernal_bulb)Infernal Bulbs$() grow on magmatic soil.$(br2)Obtained by dropping a piece of elemental soil into a pool of lava. The intense heats make this process instant.$(br2)Normal plants can also be grown on magmatic soil, and all cookable drops will cooked when harvested."
    },
    {
      "type": "spotlight",
      "item": "roots:elemental_soil_water",
      "link_recipe": true,
      "text": "$(l:herbs/dewgonia)Dewgonia$() grow on aquatic soil.$(br2)Obtained by soaking elemental soil for a short period of time in water.$(br2)Normal plants can also be grown on aqueous soil, and the soil will harvest them automagically, dropping the items below the soil for collection."
    },
    {
      "type": "spotlight",
      "item": "roots:elemental_soil_air",
      "link_recipe": true,
      "text": "$(l:herbs/cloud_berry)Cloud Berries$() grow on caelic, air-bound soil.$(br2)Obtained by exposing elemental soil to the airy heights and the open sky.$(br2)Normal plants can also be grown on caelic soil, and the soil will grow them much faster than normal."
    },
    {
      "type": "spotlight",
      "item": "roots:elemental_soil_earth",
      "link_recipe": true,
      "text": "$(l:herbs/stalicripe)Stalicripe$() grow on terran soil.$(br2)Obtained by exposing elemental soil to the dark, covered depths of underground caves and chasms.$(br2)Normal plants can also be grown on terran soil, and the fertile earth will yield much more for the crop."
    }
  ]
}