{
    "name": "The Nature of Groves",
    "icon": "roots:grove_stone",
    "category": "basics",
    "advancement": "roots:root",
    "priority": true,
    "pages": [
      {
        "type": "text",
        "text": "$(o)Extract from the writings of the Archdruid of the Silvered Glade:$()$(br2)... these entrances previously used to enter the Fey world have been closed completely. Whether this is a result of the Closing and a continue shutting down of diplomacy, or a drifting apart of the realms, the result is that trade between worlds is no longer possible."
      },
      {
        "type": "text",
        "text": "Of course, the curious denizens of that strange natural & supernatural world are ever interested in ours (and yet other realms still). The most curious of these denizens have been the smallest Fey spirits and motes, and their efforts have demonstrated that the barriers are not as Closed as we had previously imagine.$(br2)What advantage can be made from this..."
      },
      {
        "type": "text",
        "text": "$(o)Extract from the notes of the Master of Crafting:$()$(br2)... The combination of moss and our dwindling supplies of wildroot have proven sufficient to imbue a correctly-shaped standing stone, and allow it to act as an anchor for the Fey. The spirits magnetized to this anchor provide a considerable amount of energy, enough to power a specially-created crafter.$(br2)This process is rough and simple, and much refinement..."
      },
      {
        "type": "multiblock",
        "name": "Grove Stone",
        "multiblock": {
          "mapping": {
            "0": "roots:grove_stone"
          },
          "pattern": [
            [" ", "0", " "]
          ]
        },
        "enable_visualize": false,
        "text": "$(o)A sketch from the notes of the Master of Crafting$()"
      },
      {
        "type": "multiblock",
        "name": "Grove Crafter",
        "multiblock": {
          "mapping": {
            "0": "roots:grove_crafter"
          },
          "pattern": [
            [" ", "0", " "]
          ]
        },
        "enable_visualize": false,
        "text": "$(o)A sketch from the notes of the Master of Crafting$()"
      }
    ]
  }