{
  "name": "Spellcraft & Imbuing",
  "icon": "roots:staff",
  "category": "basics",
  "advancement": "roots:root",
    "pages": [
    {
      "type": "text",
      "text": "The most basic power available to a druid is spellcraft. To make, each spell requires specific components, which are broken down in a $(l:apparatus/mortar)Mortar & Pestle$() into spell dust. This dust can then be imbued into a staff.$(br2)In addition to the creation, casting spells require material components in the form of herbs."
    },
    {
      "type": "text",
      "text": "Once the spell dust has been crafted, it is imbued into the staff with an Imbuer. During the process, further reagents can be added to permanently modify the spell.$(br2)Imbuement will never override a old spell slot, instead placing the new spell in the first available empty slot, if there is one."
    },
    {
      "type": "crafting",
      "recipe": "roots:imbuer",
      "title": "Imbuer",
      "text": "Staff and spell dust can be inserted into the imbuer to begin the process. It will take a short amount of time before the upgraded staff is returned, and during this time further reagents can be applied. Other uses for this device may be uncovered in the future."
    },
    {
      "type": "crafting",
      "recipe": "roots:staff",
      "title": "Staff",
      "text": "In addition to the staff and spell dust, material components in the form of herbs must be provided from a $(l:apparatus/component_pouch)Component Pouch$() or $(l:apparatus/apothecary_pouch)Apothecary Pouch$()."
    },
    {
      "type": "text",
      "title": "Manipulating the Staff",
      "text": "The staff is capable of holding up to 5 spells. The currently selected spell is always displayed when the druid hovers over. Holding shift will allow show all imbued spells.$(br2)Sneaking while right-clicking will cycle through to the next available spells. Additional keybinds exist should you need them."
    },
    {
      "type": "text",
      "title": "Casting",
      "text": "Once a spell is selected, simply hold the staff in either hand. Depending on the type, be it one that triggers instantly or requires a period of concentration, right-click or hold right-click to activate respectively.$(br2)If the correct components are available, they will be consumed (and a visual alert will show you your remaining stock of these herbs) and the spell will be cast."
    },
    {
      "type": "text",
      "title": "Removing Spells",
      "text": "As the power of the staff is limited and can only maintain 5 spells, it may become necessary for you to remove a spell. Simply select the slot you wish to void, and imbue the staff with $(l:resources/runic_dust)Runic Dust$(). The returned staff will now be without that spell."
    },
    {
      "type": "empty"
    }
  ]
}